package no3;

import java.util.LinkedList;

/**
 * Created with IntelliJ IDEA.
 *
 * @Author: 张驰
 * @Date: 2021/09/13/20:20
 * @Description: 三尺秋水尘不染
 */
/*时间限制： 3000MS
        内存限制： 589824KB
        题目描述：
        小B正在玩一款2D射击游戏，当前关卡地图中总共有N只怪物，一个坐标点最多只有一只怪物。小B可以移动到地图中任意点开枪射击，小B的武器射击范围可以覆盖到整张地图，子弹击中怪物后会继续沿直线弹道飞行，直至飞出地图边界。

        现在小B只有一发子弹，请问小B最多可以击中多少只怪物？
        输入描述
        第一行：输入一个整数N（N＜500），表示N只怪物。

        接下来N行格式要求：每一行输入2个整数，用空格区分，分别表示一只怪物的x坐标和y坐标。（坐标范围在[0,500000] ）
        输出描述
        一个整数，表示小B击中怪物的最大数量。
        样例输入
        2
        0 0
        0 1
        样例输出
        2

 */

public class Main {
    public static void main(String[] args) {
        
    }
}
